"""
계산 그래프computational graph : 계산 과정을 그래프로 나타낸 것. 복수의 노드와 에지로 표현된다.
→←↑↓↗↙↖↘ × ∑∞²
"""

# 5.1.1 계산 그래프로 풀다
"""
문제1 : 슈퍼에서 1개 100원인 사과를 2개 사고 소비세가 10%일 때, 지불 금액은?
100 * 2 * 1.1 = 220

       200
100 → × →  × → 220
2   ↗     ↗
       1.1

문제2 : 슈퍼에서 1개 100원인 사과를 2개 사고 150원인 귤을 3개 샀다. 소비세가 10%일 때, 지불 금액은?
((100 * 2) + (150 * 3)) * 1.1 = 715

3   ↘
150 → × ↘
100 → × →  + → × → 715
2   ↗          ↗
           1.1
순전파forward propagation : 계산을 왼쪽에서 오른쪽으로 진행
역전파backward propagation : 계산을 반대 방향으로 진행. 미분을 효율적으로 계산할 수 있다.
"""

# 5.1.2 국소적 계산
"""
전체 계산이 복잡하더라도 각 단계의 일은 해당 노드의 국소적 계산이다.
"""


# 5.1.3 왜 계산 그래프로 푸는가?
"""
문제 1에서 사과 가격이 오를 때 최종 가격에 미치는 영향(=사과 가격에 대한 지불 금액의 미분)을 구하고 싶다.
사과 값 : x, 지불 금액 : L일 때, ∂L/∂x를 구하는 것.
계산 그래프의 역전파를 이용해서 구할 수 있다.
       1.1
2.2 ← × ←  × ← 1
2   ↗     ↗
       1.1
∂L/∂x = 2.2
따라서, 사과가 1원 오르면 최종 금액은 2.2원 오른다.
"""
